# ElectricalDemandFactorDefinition Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition Class
Members See Also
---
The ElectricalDemandFactorDef class represents a serialized version of an instance of demand factor definition. It has a name, rule type, and values for the rules that are serialized.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class ElectricalDemandFactorDefinition : Element
```

Visual Basic
---
```text
Public Class ElectricalDemandFactorDefinition _
	Inherits Element
```

Visual C++
---
```text
public ref class ElectricalDemandFactorDefinition : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..ElectricalDemandFactorDefinition
# See Also
ElectricalDemandFactorDefinition Members
Autodesk.Revit.DB.Electrical Namespace